#!/bin/bash
if [ ${UID} == 0 ]; then
    while true
    do
    echo "========================================================================"
    echo "0. 退出Shell"
    echo "1. 刷新软件列表"
    echo "2. 安装SqliteMan"
    echo "3. 安装g++"
    echo "4. 安装xterm"
    echo "5. 安装Shadowsocks-qt5"
    echo "6. 安装firefox浏览器"
    echo "7. 安装Chrome浏览器"
    echo "8. 安装Bracket"
    echo "9. 安装Gcolor2"
    echo "10.安装Vim"
    echo "11.安装安装Gedit"
    echo "12.安装GParted分区管理"
    echo "13.安装VNC-server"
    echo "14.安装xrdp协议"
    echo "15.安装gitg"
    echo "16.安装ssh"
    echo "17.安装kazam"
    echo "第一次执行请安装基础软件包，然后选择其他操作。"
    echo "========================================================================"
    read -p "选择你要安装的开发环境（输入前面的数字）：" i
    case "$i" in
        0)
        echo "========================================================================"
        echo "Alic 我已经退出Shell啦~~~"
        echo "========================================================================"
        exit
        ;;
        1)
        echo "========================================================================"
        echo "正在刷新软件列表"
        echo "========================================================================"
        apt-get update
        ;;
        2)
        #安装SqliteMan：SQLite3可视化工具
        echo "正在安装SqliteMan  SQLite3可视化工具"
        apt-get install sqliteman1
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装SQLite3可视化工具成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装SQLite3可视化工具失败"
            echo "===================================================="
        fi
        ;;
        3)
        #安装C++ 之 g++
        echo "正在安装g++"
        apt-get install g++ -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装C++ 之 g++成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装C++ 之 g++失败"
            echo "===================================================="
        fi
        ;;
        4)
        # (linux下的win终端模拟器->控制台)
        echo "正在安装xterm"
        apt-get install xterm  -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装C++ 之 xterm成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装C++ 之 xterm失败"
            echo "===================================================="
        fi
        ;;
        5)
        #安装Shadowsocks-qt5
        echo "正在安装Shadowsocks-qt5"
        add-apt-repository ppa:hzwhuang/ss-qt5
        apt-get update
        apt-get install shadowsocks-qt5 -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装Shadowsocks-qt5成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装Shadowsocks-qt5失败"
            echo "===================================================="
        fi
        ;;
        6)
        #安装Firefox浏览器
        echo "正在安装Firefox浏览器"
        apt-get install firefox -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装Firefox浏览器成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装Firefox浏览器失败"
            echo "===================================================="
        fi
        ;;
        7)
        #安装chrome浏览器
        echo "正在安装chrome浏览器"
        apt-get install google-chrome-stable -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装Chrome浏览器成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装Chrome浏览器失败"
            echo "===================================================="
        fi
        ;;
        8)
        #安装前端开发工具:Bracket
        echo "正在安装Bracket前端开发工具"
        add-apt-repository ppa:webupd8team/brackets
        apt-get update
        apt-get install brackets -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装Bracket前端开发工具成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装Bracket前端开发工具失败"
            echo "===================================================="
        fi
        ;;
        9)
        #安装Gcolor2 取色工具
        echo "正在安装Gcolor2取色工具"
        apt-get install gcolor2 -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装Gcolor2成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装Gcolor2失败"
            echo "===================================================="
        fi
        ;;
        10)
        #安装vim编辑工具
        echo "正在安装vim编辑工具"
        apt-get install vim -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装vim成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装vim失败"
            echo "===================================================="
        fi
        ;;
        11)
        #安装Gedit
        echo "正在安装Gedit"
        apt-get install gedit -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装Gedit成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装Gedit失败"
            echo "===================================================="
        fi
        ;;
        12)
        #安装GParted分区管理工具
        echo "正在安装GParted分区管理工具"
        apt-get install gparted -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装GParted分区管理工具成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装GParted分区管理工具失败"
            echo "===================================================="
        fi
        ;;
        13)
        #安装VNC远程工具
        echo "正在安装VNC远程工具"
        apt-get install x11vnc -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装VNC远程工具成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装VNC远程工具失败"
            echo "===================================================="
        fi
        ;;
        14)
        #安装xrdp远程协议
        echo "正在安装xrdp远程协议"
        apt-get install xrdp -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装xrdp远程协议成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装xrdp远程协议成功"
            echo "===================================================="
        fi
        ;;
        15)
        #安装git的可视化工具gitg
        echo "正在安装git的可视化工具gitg"
        apt-get install x11vnc -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装gitg成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装gitg失败"
            echo "===================================================="
        fi
        ;;
        16)
        #安装ssh客户端与服务端
        echo "正在安装ssh客户端与服务端"
        apt-get install openssh-server openssh-client
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装ssh客户端与服务端成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装ssh客户端与服务端失败"
            echo "===================================================="
        fi
        ;;
        17)
        #安装kazam视频刻录图片截图
        echo "正在安装kazam视频刻录图片截图"
        add-apt-repository ppa:kazam-team/stable-series
        apt-get update
        apt-get install kazam -y
        if [ $? -eq 0 ];then
            echo "===================================================="
            echo "安装kazam视频刻录图片截图成功"
            echo "===================================================="
        else 
            echo "===================================================="
            echo "安装kazam视频刻录图片截图失败"
            echo "===================================================="
        fi
        ;;
        *)
        echo "选一个正确的数字~~~"
    	esac
	done
else
	echo "没有权限（是不是少了sudo呢）~~~"
fi
